In [1]:
import pandas as pd 
import numpy as np

* What are Data Frames?
* What is Data Series?
* Different operations in Pandas

In [2]:
#Initial look at dataframe

#dataframe args ==> data, index(rows), columns

df = pd.DataFrame(np.arange(0,20).reshape(5,4),index = ['Row1','Row2','Row3','Row4','Row5'],columns = ['Column1','Column2','Column3','Column4'])

In [3]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
df.to_csv('SeeAsWe.csv')

In [5]:
##Accessing the elements
## 1. .loc 2. .iloc

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [6]:
#Check the type

type(df.loc['Row1'])

pandas.core.series.Series

In [7]:
#iloc[:,:] function ==> [row_Start:row_finish,column_start:column_finish]
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [8]:
df.iloc[1:,1:]

      Column2  Column3  Column4
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [9]:
type(df.iloc[1:,1:])

pandas.core.frame.DataFrame

In [10]:
df.iloc[0:2,0]

Row1    0
Row2    4
Name: Column1, dtype: int32

In [11]:
type(df.iloc[0:2,0])

pandas.core.series.Series

In [12]:
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [13]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [14]:
df.iloc[:,1:].values.shape

(5, 3)

In [15]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [16]:
df['Column1'].value_counts()

0     1
8     1
4     1
16    1
12    1
Name: Column1, dtype: int64

In [17]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [18]:
df[['Column3','Column4']]

      Column3  Column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [19]:
df = pd.read_csv('mercedesbenz.csv')

In [20]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [22]:
df.describe()

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [24]:
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
am     18
i      18
aq     18
u      17
aw     16
l      16
ad     14
k      11
b      11
au     11
r      10
as     10
bc      6
ao      4
c       3
q       2
aa      2
g       1
ab      1
ac      1
Name: X0, dtype: int64

**CSV**

In [27]:
from io import StringIO, BytesIO

In [28]:
data = ('col1,col2,col3\n'
           'x,y,1\n'
           'a,b,c\n'
           'c,d,3')

In [29]:
type(data)

str

In [ ]:
StringIO()

In [30]:
pd.read_csv(StringIO(data))

  col1 col2 col3
0    x    y    1
1    a    b    c
2    c    d    3

In [31]:
df = pd.read_csv(StringIO(data),usecols = ['col1','col2'])

In [32]:
df

  col1 col2
0    x    y
1    a    b
2    c    d

In [33]:
df.to_csv('Test.csv')

In [34]:
df

  col1 col2
0    x    y
1    a    b
2    c    d

In [36]:
df['col1']

0    x
1    a
2    c
Name: col1, dtype: object

In [37]:
print(df)

  col1 col2
0    x    y
1    a    b
2    c    d

In [39]:
new_data = ('1,4,6\n'
           'x,y,z\n'
           '%,^,&\n')

In [40]:
pd.read_csv(StringIO(new_data))

   1  4  6
0  x  y  z
1  %  ^  &

In [42]:
df1 = pd.read_csv(StringIO(new_data))

In [43]:
df1['4']

0    y
1    ^
Name: 4, dtype: object

In [50]:
nu_data = ('a,b,c,d\n'
          '1,2,3,4\n'
          '5,6,7,8\n'
          '9,10,11,12\n')

In [51]:
print(nu_data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [54]:
df = pd.read_csv(StringIO(nu_data),dtype ={'b':int,'c':float,'a':'Int64'})

In [55]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [56]:
df['a'][1]

5

In [57]:
df.dtypes

a      Int64
b      int32
c    float64
d      int64
dtype: object

In [58]:
data = ('index,a,b,c\n'
       '4,apple,bat,5.7\n'
       '8,orange,cow,10')

In [60]:
pd.read_csv(StringIO(data),index_col = 0)

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [66]:
pd.read_csv(StringIO(data),index_col =False)

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [67]:
##Quoting and Escape characters. Very useful in NLP. \t and \\ are seperators

data = 'a,b\n"hello,\\"Bob\\",nice to see you ", 5'

In [68]:
pd.read_csv(StringIO(data),escapechar = '\\')

                              a  b
0  hello,"Bob",nice to see you   5

In [69]:
## URL to CSV

df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',
                 sep='\t')

In [70]:
df.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359